In [1]:
import sqlite3

In [ ]:
CREATE TABLE student(
    student_id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(20) NOT NULL,
    major VARCHAR(20) DEFAULT 'undecided',   
);

In [ ]:
DROP TABLE student;
ALTER TABLE student ADD gpa DECIMAL(3,2)
ALTER TABLE student DROP COLUMN gpa;
INSERT INTO student VALUES(1,'Jack','Biology' );
INSERT INTO student VALUES(2,'Kate','Sociology');
INSERT INTO student(student_id, name) VALLUES(4, 'Peter');
INSERT INTO student VALUES(3, 'Jack', 'CS')

In [ ]:
SELECT * FROM student;

In [ ]:
# Update 
UPDATE student
SET major ='BIO'
WHERE major = 'Biology';

UPDATE student
SET major = 'Computer Science'
WHERE major = 'CS';

UPDATE student
SET major ='Biochemistry'
WHERE major ='Bio' OR major ='Chemistry';

UPDATE student
SET name = 'Tom', major ='undecided'
WHERE student_id =1;

In [ ]:
# DELECT
DELECT FROM student
WHERE student_id = 5;
DELECT FROM student
WHERE name = 'Tom' AND major ='undecided';

In [ ]:
SELECT * FROM student;

SELECT name FROM student;

SELECT name, major FROM student
ORDER BY name DESC;

SELECT name, major FROM student
ORDER BY name, major
LIMIT 2;

SELECT * FROM student
WHERE major ='biology';

SELECT name, major FROM student
WHERE major ='biology' OR name ='Kate';

In [ ]:
SELECT * FROM student
WHERE major IN ('Biology','Chemisty') AND student_id > 3;

In [ ]:
# Complex sql

In [ ]:
CREATE TABLE employee(
    emp_id INT PRIMARY KEY,
    first_name VARCHAR(40),
    last_name VARCHAR(40),
    birth_day DATE,
    sex VARCHAR(1),
    salary INT,
    super_id INT,
    branch_id INT,
);

In [ ]:
CREATE TABLE branch(
    branch_id INT PRIMARY KEY,
    branch_name VARCHAR(40),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGH KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL    
);

In [ ]:
ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCE branch(branch_id)
ON DELECT SET NULL;

In [ ]:
SElECT * FROM employees;

SELECT * FROM clients;

SELECT salary FROM employees
ORDER BY salary DESC;

In [ ]:
SELECT COUNT(emp_id) FROM employees;

In [ ]:
ALTER TABLE student ADD gpa DECIMAL(3,2);

In [ ]:
ALTER TABLE student DROP column name;

In [ ]:
INSERT INTO student VALUES(1,'Jack','Biology');
INSERT INTO student VALUES(2,'Kate','Sociolgy');
INSERT INTO student(student_id, name) VALUES(3, 'Claire')

In [ ]:
SELECT * FROM student;

In [ ]:
CREATE TABLE student(
    student_id INT AUTO_INCREMENT,
    name VACHAR(20) NOT NULL,
    major VARCHAR(20) DEFAULT 'undecided',
    PRIMARY KEY(student_id)
)

In [ ]:
INSERT INTO student(student_id, name,major) VALUE(1, 'Jack','CS')

In [ ]:
UPDATE student 
SET major ='Bio'
WHERE major ='Biology';

In [ ]:
UPDATE student
SET major ='CS'
WHERE  major ='Computer Science';

In [ ]:
UPDATE student
SET major = 'Biochemistry'
WHERE major = 'Bio' OR major ='Chemistry';

In [ ]:
UPDATE student 
SET name ='Tom', major = 'undecided'
WHERE student_id = 1;

In [ ]:
DELETE FROM student
WHERE name = 'Tom' AND major = 'undecided';

In [ ]:
DELECT FROM student;

In [ ]:
SELECT * FROM student;
SELECT name FROM student
ORDER BY name DESC
LIMIT 2;

In [ ]:
SELECT name, major
FROM student
WHERE major = 'Chemisty' OR major ='Biology';

In [ ]:
SELECT name FROM student
WHERE major <> 'Chemistry';

In [ ]:
DROP TABLE studentï¼›

In [ ]:
CREATE TABLE employee (
    emp_id PRIMARY KEY,
    first_name VARCHAR(40),
    last_name VARCHAR(40),
    birth_day DATE,
    sex VARCHAR(1)
    salary INT,
    super_id INT,
    branch_id INT
    );

In [ ]:
CREATE TABLE branch(
    branch_id INT PRIMARY KEY,
    branch_id INT VARCHAR(40),
    mgr_id INT,
    mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCE employee(emp_id) ON DELETE SET NULL );

In [ ]:
ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL;

In [ ]:
ALTER TABLE employee
ADD FOREIGN KEY(super_id)
REFERENCE employee(emp_id)
ON DELETE S